# Sort by Index with `.sort_index()`

### Import Pandas

In [2]:
import pandas as pd

### Read CSV

In [3]:
salaries = pd.read_csv("mls_salaries.csv")

### Head

In [6]:
salaries.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,NaN,75000.0,93750.00

### `.rank()`

In [9]:
salaries["base_salary"]

0      1912500.0
1        65625.0
2       150000.0
3        99225.0
4        65000.0
         ...
610     126500.0
611      80000.0
612     350000.0
613          NaN
614     175000.0
Name: base_salary, Length: 615, dtype: float64

In [11]:
salaries["base_salary"].rank()

0      602.0
1      144.0
2      354.0
3      239.0
4       84.0
       ...
610    315.0
611    203.0
612    507.0
613      NaN
614    384.0
Name: base_salary, Length: 615, dtype: float64

In [12]:
salaries["base_salary"].rank(ascending=False)

0       13.0
1      471.0
2      261.0
3      376.0
4      531.0
       ...
610    300.0
611    412.0
612    108.0
613      NaN
614    231.0
Name: base_salary, Length: 615, dtype: float64

### Exploring how `.rank()` works

In [30]:
# sort values in descending order, highest to lowest
sorted_salary = salaries["base_salary"].sort_values(ascending=False)

In [32]:
# rank sorted base_salary column
sorted_salary.rank(ascending=False).head(20)

401     1.0
560     2.0
355     3.0
568     4.5
349     4.5
55      6.0
556     7.0
230     8.0
506     9.0
472    10.0
347    11.0
103    12.0
0      13.0
487    14.0
52     15.0
224    16.0
98     17.0
384    18.0
599    19.0
513    20.0
Name: base_salary, dtype: float64

In [34]:
# what value is row 401 which is rated at 1.0?
salaries["base_salary"].iloc[401]

6660000.0

In [35]:
# what is the maximum salary? sames as rank 1.0?
salaries["base_salary"].max()

6660000.0